import Head from "next/head";
import { FunctionComponent } from "react";

interface PrivacyPolicyProps { }

const PrivacyPolicyPage: FunctionComponent<
  PrivacyPolicyProps
> = () => {
  return (
    <>
      <Head>
        <title>Privacy Policy</title>
      </Head>
      <div dir='rtl' style={{
        padding: '50px 25px'
      }}>
        <h2>بيانات الاتصال</h2>
        <p>إذا كان لديك أي استفسار أو طلبات بخصوص سياسة الخصوصية هذه أو كيف نتعامل مع بياناتك بشكل عام، يرجى الاتصال بنا على طريق البريد الإلكتروني <a href="mailto: info@paprika-sy.com">info@paprika-sy.com</a>.</p>

        <h2>كيف نقوم بجمع معلوماتك</h2>
        <p>نقوم بجمع معلوماتك الشخصية عندما تتفاعل معنا أو تستخدم خدماتنا، مثلا عندما تستخدم موقعنا، أو تطبيقنا لإرسال طلب. وننظر أيضاً في كيفية استخدام الزوار لموقعنا، لمساعدتنا على تحسين خدماتنا وتحسين تجربة العملاء. نقوم بجمع المعلومات في الحالات التالية:</p>
        <ul>
          <li>عند انشاء إنشاء حساب أو تغيير إعدادات حساب.</li>
          <li>عند إرسال طلب أو عند عملية الطلب (بما في ذلك انشاء وتسليم طلب).</li>
          <li>عند التواصل معنا مباشرة عبر البريد الإلكتروني أو الهاتف أو الرسالة أو عبر وظيفة التواصل معنا.</li>
        </ul>

        <h2>المعلومات التي نجمعها عنك</h2>
        <p>كجزء من التزامنا بخصوص عملائنا وزائري مواقعنا بشكل عام، نريد أن نكون واضحين بشأن أنواع المعلومات التي سنجمعها عنك. عند إرسال طلب من خلال منصة بابريكا لأول مرة يطلب منك تقديم معلومات عن نفسك بما في ذلك اسمك وتفاصيل الاتصال والعنوان وتفاصيل الخدمات. نجمع أيضا معلومات حول استخدامك للعناوين، ومعلومات عنك من أي رسائل ترسلها الينا أو عند الاتصال بنا وتزويدنا بتعليقات، بما في ذلك عبر البريد الالكترني. نقوم بجمع معلومات فنية من جهازك المعمول أو جهاز الحاسب الخاص بك، مثل نظام التشغيل الخاص به، الجهاز ونوعه ونوع الاتصال وعنوان IP الذي تدخل منه إلى مواقعنا.</p>

        <h2>استخدام المعلومات الخاصة بك</h2>
        <p>سنقوم بمعالجة البيانات التي نجمعها عنك فقط إذا كان هناك سبب للقيام بذلك، وإذا كان هذا السبب مسموحاً به. سيكون لدينا أساس قانوني لمعالجة المعلومات الخاصة بك إذا كنا بحاجة إلى معالجة معلوماتك الخاصة من أجل تزويدك بالخدمة التي طلبتها أو للدخول في عقد فلدينا موافقتك ولدينا سبب مبرر لمعالجة بياناتك، ونحن ملزمون قانونياً بالقيام بذلك. حيثما نحتاج لتزويدك بالخدمة التي طلبتها أو للدخول في عقد نستخدم معلوماتك:</p>
        <ul>
          <li>لتمكيننا من تزويدك بالوصول إلى الأجزاء ذات الصلة بالمنصة.</li>
          <li>لتوفير الخدمات التي طلبتها.</li>
          <li>لتحصيل الدفعات المالية في حال وجودها.</li>
          <li>للاتصال بك عند الضرورة فيما يتعلق بخدماتنا، مثل حل المشكلات التي قد تواجهنا في طلبك.</li>
        </ul>

        <p>نقوم أيضاً بمعالجة بياناتك حيث يكون لدينا سبب مبرر للقيام بذلك، على سبيل المثال تخصيص خدماتنا، بما في ذلك معالجة البيانات لجعل الأمر أسهل وأسرع بالنسبة لك لتقديم الخدمات. أدرجنا هذه الأسباب أدناه:</p>
        <ul>
          <li>تحسين فعالية وجودة الخدمة التي يتوقعها عملاؤنا في المستقبل.</li>
          <li>لتخصيص المحتوى الذي نعرضه لك، نحن أو أي مطعم مشترك أو شركاء الإعلان، على سبيل المثال حتى نتمكن من عرض المطاعم الموجودة في منطقتك أو التأكد من أنك ترى الإعلان الأكثر صلة بك استناداً إلى الخصائص المحددة بواسطتنا.</li>
          <li>لتمكين فريق دعم العملاء لدينا من مساعدتك في أي استفسارات أو شكاوى بأكثر الطرق فعالية ممكنة ولتقديم تجربة إيجابية للعملاء.</li>
          <li>للاتصال بك والاطلاع على إرائك  وملاحظاتك وإبلاغك إذا كانت هناك أي تغييرات أو تطورات مهمة على المواقع وخدماتنا، وبما في ذلك إعلانك بأن خدماتنا تعمل في منطقة جديدة، في حال كنت قد طلبت منا فعل ذلك.</li>
          <li>لإرسال معلوماتك إليك عن منجاتنا وخدماتنا وعروضنا الترويجية.</li>
        </ul>

        <h2>التسويق المباشر</h2>
        <p>في حال منحنا موافقتك أو عندما يكون لدينا سبب مبرر للقيام بذلك، سوف نستخدم معلوماتك لإعلامك بمنتجاتنا وخدماتنا الأخرى التي قد تهمك عن طريق البريد الإلكتروني، يمكنك التحكم في تفضيلات التسويق عبر البريد الإلكتروني الخاصة بنا أو من خلال تطبيق الهاتف المحمول.</p>

        <h2>الاحتفاظ بمعلوماتك</h2>
        <p>لن نحتفظ بمعلوماتك لفترة أطول مما نعتقد أنه ضروري. سيتم الاحتفاظ بالمعلومات ما دامت هناك حاجة للوفاء بالأغراض الموضحة في قسم استخدام المعلومات الخاصة بك أعلاه لما يتماشى مع مصلحتنا المشروعة أو لفترة تشترطها على وجه التحديد اللوائح أو القوانين المعمول بها، مثل الحفاظ على المعلومات لأغراض تنظيمية. عند تحديد فترات الاستبقاء ذات الصلة، سنأخذ في الاعتبار العوامل التالية:</p>
        <ul>
          <li>التزامنا وحقوقنا التعاقدية فيما يتعلق بالمعلومات المعينة.</li>
          <li>التزامات قانونية بموجب القانون المعمول به بالاحتفاظ بالبيانات لفترات زمنية معينة.</li>
          <li>المنازعات المحتملة.</li>
          <li>بخلاف ذلك، نقوم بمسح معلوماتك بشكل آمن حيث لم نعد نحتاج إلى معلوماتك للأغراض التي تم جمعها.</li>
        </ul>

        <h2>حذف معلوماتك</h2>
        <p>يمكن للمستخدمين حذف كامل البيانات الخاصة بهم التي جرى جمعها على منصة بابريكا عن طريق إرسال بريد إلكتروني إلى <a href="mailto: support@paprika-sy.com">support@paprika-sy.com</a> يجب أن يحمل البريد الإلكتروني المرسل عنوان (طلب حذف حساب)، ويتضمن اسم المستخدم ورقم الهاتف الخاص بمستخدم الحساب. نقوم بالتواصل مع صاحب الحساب المعني بعد مراجعة البريد الإلكتروني والتأكد من بعض المعلومات الخاصة به، ثم نقوم بحذف الحساب الخاص به مع كامل المعلومات المسجلة.</p>

        <h2>مشاركة المعلومات</h2>
        <p>نحن نشارك معلومات مع مزودي خدمة الطرف الثالث، وتشمل أنواع مزودي خدمة الجهات الخارجية الذين نشاركهم معلوماتك معهم:</p>
        <ul>
          <li>المطاعم الشريكة: نقوم بتزيد المطاعم الشريكة بمعلوماتك عند قيامك باللطب منهم حتى يتمكنوا من تلبية طلبك، أو لحل المشاكل أو تحسين خدماتهم.</li>
          <li>مخدمي التوصيل: حتى يتمكنوا من توصيل الطلب لك.</li>
          <li>موظفي قسم خدمة العملاء.</li>
          <li>شركاء التسويق والإعلان</li>
          <li>الجهات القضائية في حال وجود إي إلتزام قانوني.</li>
        </ul>

        <h2>التغيريات في سياسة الخصوصية لدينا</h2>
        <p>سيتم نشر أي تغييرات تطرأ على سياسة الخصوصية الخاصة بنا على مواقعنا، عند الاقتضاء سوف نخبرك بالتغييرات على سبيل المثال عن طريق البريد الاإلكتروني، أو باقي وسائل التواصل الإجتماعي وعبر خدمة العملاء.</p>

        <h2>الشكاوى</h2>
        <p>إذا لم تكن راضيا على سياسة الخصوصية وفيما يتعلق باستخدام معلوماتك، يمكنك تقديم شكوى إلى البريد الإلكتروني التالي <a href="mailto: privacy@paprika-sy.com">privacy@paprika-sy.com<a /></a>.</p>
      </div>
    </>
  );
};



export default PrivacyPolicyPage;